/* Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

a = 5; b = 7 -> max = 7
a = 2 b = 10 -> max = 10
a = -9 b = -3 -> max = -3

*/


//Console.Clear();

Console.WriteLine("Привет, я найду число которое будет больше из двух числе!");

Console.WriteLine("Введите число: ");
    int a = int.Parse(Console.Readline());

Console.WriteLine("Введите второе число: ");
    int b = int.Parse(Console.Readline());



